void main() {
// int b = 10;
// int c = 9;
// int a = 8;
// double h = 5;
// b += 10; // Добавить и назначить (b = b + 10)
// c -= 9; // Вычесть и назначить (с = с - 10)
// a *= 10; // Умножить и назначить (a = a * 10)
// h /= 10; // Разделить и назначить (h = h / 10 )
// оператор ! сравнивает что два числа не равны ли друг другу
// оператор && сравнивает оба числа
// оператор || сравнивает либо одно число либо другое
// оператор is возвращает тру если обьект иммет указанный тип данных сравнение по типу
// оператор !is возвращает тру если обьект не имеет указанный тип данных сравнение по типу
// тернарный оператор if-else ? 
// int a = 10;
// if (a == 10) {
//   print("это 10");
// } else {
//   print("это не 10");
// }
// print(a == 10? "это 10" : " 'это не 10");

String a = "10";
print(int.tryParse(a)?? 0);



}

